<?php
// Задача 1:Написать калькулятор перевода
//Начальные значения
    $in_0 = 1;
    $mi_0 = 1;
    $tC_0 = 1;
    $tF_0 = 1;
    $Nm_0 = 1;
    $km_0 = 1;
    $ft_0 = 1;
    $gallon_0 = 1;
//Перевод дюймов в сантиметры
    $cm = $in_0*2.54;
    echo $in_0 . " дюйм =" . round($cm, 2) . "см" . "<br>";
//Перевод дюймов в метры
    $metr = $in_0*0.0254;
    echo $in_0 . " дюйм =" . round($metr, 4) . "м" . "<br>";
//Перевод милей в километры
    $km = $mi_0*1.6;
    echo $mi_0 . " миля =" . round($km, 2) . " kм" . "<br>";
//Перевод милей в метры
    $metr = $mi_0*1609;
    echo $mi_0 . " миля =" . $metr . " м" . "<br>";
//Перевод градусов Цельсия в Фаренгейты
    $tF = 1.8*$tC_0+32;
    echo $tC_0 . " C =" . $tF . " F" . "<br>";
//Перевод Фаренгейтов в градусы Цельсия
    $tC = ($tF_0-32)/1.8;
    echo $tF_0 . " F =" . round($tC, 2) . " C" . "<br>";
//Перевод морских милей в километры
    $km = $Nm_0*1.852;
    echo $Nm_0 . " морская миля  = " . round($km, 3) . " км" . "<br>";
//Перевод километра в сантиметры
    $cm = $km_0*100000;
    echo $km_0 . " км = " . $cm . " см" . "<br>";
//Перевод Футов в метры
    $metr = $ft_0*0.3048;
    echo $ft_0 . " фут  = " . round($metr, 4) . " м" . "<br>";
//Перевод Галлона (англ) в литры
    $litr = $gallon_0 *4.5461;
    echo $gallon_0 . " галлон = " . round($litr, 4) . " л" . "<br>";
